In [1]:
import pandas as pd

Q1. List any five functions of the pandas library with execution.

Five dunctions are :
    
    1: head()
    
    2: describe()
    
    3: loc() and iloc()
    
    4: isnull()
    
    5: unique()

In [2]:

df = pd.read_csv("services.csv")

In [3]:
df.head(2)

,id,location_id,program_id,accepted_payments,alternate_name,application_process,audience,description,eligibility,email,...,interpretation_services,keywords,languages,name,required_documents,service_areas,status,wait_time,website,taxonomy_ids
0,1,1,NaN,NaN,NaN,Walk in or apply by phone.,"Older adults age 55 or over, ethnic minorities...",A walk-in center for older adults that provide...,"Age 55 or over for most programs, age 60 or ov...",NaN,...,NaN,"ADULT PROTECTION AND CARE SERVICES, Meal Sites...",NaN,Fair Oaks Adult Activity Center,NaN,Colma,active,No wait.,NaN,NaN
1,2,2,NaN,NaN,NaN,Apply by phone for an appointment.,Residents of San Mateo County age 55 or over,Provides training and job placement to eligibl...,"Age 55 or over, county resident and willing an...",NaN,...,NaN,"EMPLOYMENT/TRAINING SERVICES, Job Development,...",NaN,Second Career Employment Program,NaN,San Mateo County,active,Varies.,NaN,NaN

In [4]:
df.describe()

             id  location_id  program_id
count  23.00000    23.000000         0.0
mean   12.00000    11.956522         NaN
std     6.78233     6.711444         NaN
min     1.00000     1.000000         NaN
25%     6.50000     6.500000         NaN
50%    12.00000    12.000000         NaN
75%    17.50000    17.500000         NaN
max    23.00000    22.000000         NaN

In [5]:
df.loc[0:10,["location_id","program_id","accepted_payments"]]

    location_id  program_id accepted_payments
0             1         NaN               NaN
1             2         NaN               NaN
2             3         NaN               NaN
3             4         NaN               NaN
4             5         NaN               NaN
5             6         NaN               NaN
6             7         NaN               NaN
7             8         NaN               NaN
8             9         NaN               NaN
9            10         NaN               NaN
10           11         NaN               NaN

In [6]:
df.iloc[0:10,[0,5,1,10]]

,id,application_process,location_id,fees
0,1,Walk in or apply by phone.,1,$2.50 suggested donation for lunch for age 60 ...
1,2,Apply by phone for an appointment.,2,None. Donations requested of clients who can a...
2,3,Phone for information (403-4300 Ext. 4322).,3,None.
3,4,Apply by phone.,4,"Vary according to income ($5-$90). Cash, check..."
4,5,Phone for information.,5,$60 application fee. Cash or checks accepted.
5,6,Walk in or apply by phone for membership appli...,6,$55 per year membership dues. Classes have fee...
6,7,"Apply by phone or be referred by a doctor, soc...",7,$85 per day. Vary according to income for thos...
7,8,Apply by phone.,8,Suggested donation of $4.25 per meal for senio...
8,9,Walk in. Proof of residency in California requ...,9,None.
9,10,Walk in. Proof of California residency to rece...,10,None.

In [7]:
df.isnull().sum()

id                          0
location_id                 0
program_id                 23
accepted_payments          22
alternate_name             22
application_process         0
audience                    9
description                 0
eligibility                 2
email                      22
fees                        2
funding_sources             2
interpretation_services    22
keywords                    2
languages                  22
name                        0
required_documents         22
service_areas               2
status                      0
wait_time                   4
website                    21
taxonomy_ids               22
dtype: int64

In [8]:
df["location_id"].unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19, 20, 21, 22])

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [9]:
df[["A","B","C"]] =100

In [10]:
new_df = df[["A","B","C"]]

In [11]:
new_df.reindex([i for i in range(1,len(df['A']),2)])

      A    B    C
1   100  100  100
3   100  100  100
5   100  100  100
7   100  100  100
9   100  100  100
11  100  100  100
13  100  100  100
15  100  100  100
17  100  100  100
19  100  100  100
21  100  100  100

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [12]:
v = {"Values" : [10,20,30,40,50]}

In [13]:
df1 = pd.DataFrame(v)

In [14]:
sum(df1['Values'][0:3])

60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [15]:
def count_(df):
    count = []
    for i in df['Text'].values:
        count.append(len(i))
    df["Word_Count"] = count
    return df

In [16]:
t = {"Text" :["Prabhat","Tripathi","Siddharth","Thakur"] }

In [17]:
df = pd.DataFrame(t)

In [18]:
count_(df)

        Text  Word_Count
0    Prabhat           7
1   Tripathi           8
2  Siddharth           9
3     Thakur           6

Q5. How are DataFrame.size() and DataFrame.shape() different?

Syntax: dataframe.size

Return : Returns size of dataframe/series which is equivalent to total number of elements. That is rows x columns.

Syntax: dataframe.shape

Return : Returns tuple of shape (Rows, columns) of dataframe/series

In [19]:
df.size

8

In [20]:
df.shape

(4, 2)

In [21]:
df

        Text  Word_Count
0    Prabhat           7
1   Tripathi           8
2  Siddharth           9
3     Thakur           6

Q6. Which function of pandas do we use to read an excel file?

read_excel()

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [22]:
def username_(df):
    usr = [i.split("@")[0] for i in df['Email']]
    df['Username'] = usr
    return df

In [23]:
email = {"Email" : ['prabhat@gmail.com','Tripathi@gmail.com','siddharth@gmail.com','satya@gmail.com']}

In [24]:
df1= pd.DataFrame(email)

In [25]:
username_(df1)

                 Email   Username
0    prabhat@gmail.com    prabhat
1   Tripathi@gmail.com   Tripathi
2  siddharth@gmail.com  siddharth
3      satya@gmail.com      satya

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:

A B C

0 3 5 1

1 8 2 7

2 6 9 4

3 2 3 5

4 9 1 2

Your function should select the following rows: 

  A B C

1 8 2 7

4 9 1 2

The function should return a new DataFrame that contains only the selected rows.

In [26]:
def select(df):
    return df[(df['A']>5)&(df['B']<10)]

In [27]:
df = pd.DataFrame({'A' : [3,8,6,2,9], 'B' : [5,2,9,3,1], 'C' : [1,7,4,5,2]})

In [28]:
select(df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [29]:
def mean_median_standard_deviation(df):
    return df['Values'].std(),df['Values'].mean(),df['Values'].median()

In [30]:
value = {'Values' : [1,12,65,36,98,32,1,56,9,]}

In [31]:
df = pd.DataFrame(value)

In [32]:
std,mean,median = mean_median_standard_deviation(df)

In [33]:
print(f"Mean is : {mean}, Median is : {median},Standard Deviation : {std}")

Mean is : 34.44444444444444, Median is : 32.0,Standard Deviation : 33.23067525311181

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [50]:
data = {'Date':["1989-01-02","1989-01-03","1989-01-04","1989-01-05","1989-01-09","1989-01-10","1989-01-11","1989-01-12","1989-01-13","1989-01-16"],'Sales' : [10,123,4,56,14,643,23,342,34,3]}

In [56]:
def movingaverage(df):
    df['MovingAvrage'] = df['Sales'].rolling(window = 7,min_periods = 1).mean()
    return df
df = pd.DataFrame(data)
movingaverage(df)

         Date  Sales  MovingAvrage
0  1989-01-02     10     10.000000
1  1989-01-03    123     66.500000
2  1989-01-04      4     45.666667
3  1989-01-05     56     48.250000
4  1989-01-09     14     41.400000
5  1989-01-10    643    141.666667
6  1989-01-11     23    124.714286
7  1989-01-12    342    172.142857
8  1989-01-13     34    159.428571
9  1989-01-16      3    159.285714

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:

Date

0 2023-01-01

1 2023-01-02

2 2023-01-03

3 2023-01-04

4 2023-01-05

Your function should create the following DataFrame:


Date Weekday

0 2023-01-01 Sunday

1 2023-01-02 Monday

2 2023-01-03 Tuesday

3 2023-01-04 Wednesday

4 2023-01-05 Thursday

The function should return the modified DataFrame.

In [34]:
def day_date(df):
    d = []
    for i in df['Date']:
        d.append(i.split("-")[-1])
    df['Weekday'] = [day[int(i)] for i in d]
    return df

In [35]:
date = {'Date' : ['2023-01-1','2023-01-02','2023-01-03','2023-01-04','2023-01-05']}
day = ['Sunday','Monday','Tuesday','Wednesday','Thusrday','Friday','Saturday']

In [36]:
df = pd.DataFrame(date)

In [37]:
day_date(df)

         Date    Weekday
0   2023-01-1     Monday
1  2023-01-02    Tuesday
2  2023-01-03  Wednesday
3  2023-01-04   Thusrday
4  2023-01-05     Friday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [40]:
data = {'date': ['2023-01-01', '2023-01-05', '2023-01-31','2023-02-05'], 'sales': [100, 200, 300,1000]}
df1 = pd.DataFrame(data)

x,y = df1[(df1['date'] == "2023-01-01")  | (df1['date'] == '2023-01-31')].index

df1.loc[x:y,df1.columns]

         date  sales
0  2023-01-01    100
1  2023-01-05    200
2  2023-01-31    300

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

In [ ]:
import pandas